{"collection":"riyadussalihin","bookNumber":"17","chapterId":"288.00","hadithNumber":"1617","hadith":[{"lang":"en","chapterNumber":"288","chapterTitle":"Prohibition of Show-off","urn":1624190,"body":"<p>Abu Hurairah (May Allah be pleased with him) said: I heard the Messenger of Allah (ﷺ) saying, \"The first to be judged on the Day of Resurrection will be a man who had died as a martyr. He will be brought forward. Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. Then He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I fought for Your Cause till I was martyred.' Allah will say: 'You have lied. You fought so that people might call you courageous; and they have done so.' Command will then be issued about him and he will be dragged on his face and thrown into Hell. Next a man who had acquired and imparted knowledge and read the Qur'an will be brought forward, Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. Then He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I acquired knowledge and taught it, and read the Qur'an for Your sake.' Allah will say to him: 'You have lied. You acquired knowledge so that people might call you a learned (man), and you read the Qur'an so that they might call you a reciter, and they have done so.' Command will then be issued about him, and he will be dragged on his face and thrown into Hell. Next a man whom Allah had made affluent and to whom Allah had given plenty of wealth, will be brought forward, Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I did not neglect any of the ways You liked wealth to be spent liberally for Your sake'. Allah will say to him: 'You have lied. You did it so that people might call you generous, and they have done so.' Command will then be issued about him and he will be dragged on his face and thrown into Hell.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"288","chapterTitle":"- باب تحريم الرياء","urn":1716070,"body":"<p>- وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏ إن أول الناس يقضى يوم القيامة عليه رجل اسُتشهد، فأتي به، فعرفه نعمته، فعرفها، قال‏:‏ فما عملت فيها‏؟‏ قال‏:‏ قاتلت فيك حتى اسُتشهدت، قال‏:‏ كذبت، ولكنك قاتلت لأن يقال‏:‏ جريء، فقد قيل، ثم أمر به، فسحب على وجهه حتى ألقي في النار‏.‏ ورجل تعلم العلم وعلمه، وقرأ القرآن، فأتي به، فعرفه نعمه فعرفها‏.‏ قال فما عملت فيها‏؟‏ قال تعلمت العلم وعلمته وقرأت فيك القرآن‏.‏ قال كذبت، ولكنك تعلمت ليقال‏:‏ عالم‏.‏ وقرأت القرآن ليقال‏:‏ هو قارئ، فقد قيل‏:‏ ثم أُمر به، فسُحب على وجهه حتى ألقي في النار، ورجل وسع الله عليه، وأعطاه من أصناف المال، فأتي به فعرفه نعمه، فعرفها‏.‏ قال‏:‏ فما عملت فيها ‏؟‏ قال‏:‏ ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك، قال‏:‏ كذبت، ولكنك فعلت ليقال‏:‏ جواد، فقد قيل، ثم أُمر به فسُحب على وجهه ثم ألقي في النار‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏\n ‏جَريء‏ ‏ بفتح الجيم وكسر الراء وبالمد، أي‏:‏ شجاع حاذق</p>","grades":[]}]}
