{"collection":"riyadussalihin","bookNumber":"8","chapterId":"217.00","hadithNumber":"1215","hadith":[{"lang":"en","chapterNumber":"217","chapterTitle":"The Excellence of Observing Saum (Fasts) during Ramadan","urn":1622590,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Allah the Exalted and Majestic said: 'Every act of the son of Adam is for him, except As-Siyam (the fasting) which is (exclusively) for Me, and I will reward him for it.' Fasting is a shield. When anyone of you is observing fast, he should neither indulge in obscene language nor should he raise his voice; and if anyone reviles him or tries to quarrel with him, he should say: 'I am fasting.' By Him in Whose Hand the soul of Muhammad is, the breath of one observing Saum is sweeter to Allah than the fragrance of musk. The one who fasts, experiences two joys: he feels pleasure when he breaks the fast. He is joyful by virtue of his fast when he meets his Rubb.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>In a narration by Al-Bukhari, the Messenger of Allah (ﷺ) said, \"Allah says: '(The person observing Saum) has abstained from food and drink, and sexual pleasures for My sake; fasting is for Me, and I will bestow its reward. Every good deed has ten times its reward'.\"<br/><br/>In a narration by Muslim, the Messenger of Allah (ﷺ) said, \"The reward of every (good) deed of a person is multiplied from ten to seven hundred times. Allah (SWT) says: 'The reward of observing Saum is different from the reward of other good deeds; Saum is for Me, and I Alone will give its reward. The person observing Saum abstains from food and drink only for My sake.' The fasting person has two joyous occasions, one at the time of breaking his fast, and the other at the time of meeting his Rubb. Surely, the breath of one observing Saum is better smelling to Allah than the fragrance of musk.\"<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"217","chapterTitle":"- باب وجوب صوم رمضان وبيان فضل الصيام وما يتعلق به‏:‏","urn":1712050,"body":"<p>- وعن أبي هريرة رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏قال الله عز وجل‏:‏ كل عمل ابن آدم له إلا الصيام، فإنه لي وأنا أجزي به‏.‏ والصيام جُنة فإذا كان يوم صوم أحدكم فلا يرفث ولا يصخب، فإن سابه أحد أو قاتله، فليقل‏:‏ إني صائم‏.‏ والذي نفس محمد بيده لخُلوف فم الصائم أطيب عند الله من ريح المسك‏.‏ ‏\"‏للصائم فرحتان يفرحهما‏:‏ إذا أفطر فرح بفطره، وإذا لقي ربه فرح بصومه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏‏(‏‏(‏وهذا لفظ رواية البخاري‏.‏ وفي رواية له‏:‏ يترك طعامه، وشرابه، وشهوته، من أجلي، الصيام لي وأنا أجزي به، والحسنة بعشر أمثالها‏.‏ وفي رواية لمسلم‏:‏ ‏\"‏كل عمل ابن آدم يضاعف‏:‏ الحسنة بعشر أمثالها إلى سبعمائة ضعف‏.‏ قال الله تعالى‏:‏ ‏(إلا الصوم فإنه لي وأنا أجزي به‏:‏ يدع شهوته وطعامه من أجلي‏.‏ للصائم فرحتان‏:‏ فرحة عند فطره، وفرحة عند لقاء ربه‏.‏ ولخلوف فيه أطيب عند الله من ريح المسك‏)‏‏.‏</p>","grades":[]}]}
