{"collection":"riyadussalihin","bookNumber":"8","chapterId":"212.00","hadithNumber":"1175","hadith":[{"lang":"en","chapterNumber":"212","chapterTitle":"Excellence of Standing in Prayer at Night","urn":1622190,"body":"<p>Hudhaifah (May Allah be pleased with him) reported: I performed Salat with the Prophet (ﷺ) one night, and he started reciting Surat Al- Baqarah. I thought that he would go in Ruku' (bowing posture in Salat) at the end of one hundred Ayat, but he continued (reciting); and I thought that he would perhaps recite (this Surah) in the whole Rak'ah (prayer), but he continued the recitation; I thought he would perhaps bow on completing (this Surah). He (ﷺ) then started reciting Surat An-Nisa' which he followed with Surat Al-Imran. He recited leisurely. When he recited an Ayah which mentioned the tasbeeh, he would say Subhan Allah and when he recited the Ayah which tells how the Rubb is to be asked, the Messenger of Allah (ﷺ) would then ask from Him; and when he (ﷺ) recited an Ayah asking one to seek Protection Allah, he would seek Protection of Allah. Then he bowed and said, \"Subhana Rabbiyal-Azim (My Rubb the Great is free from imperfection)\"; his bowing lasted about the same length of time as his standing, (and then on returning to the standing posture after Ruku') he would say, \"Sami' Allahu liman hamidah, Rabbana lakal-hamd (Allah listens to him who praises Him. Praise be to You, Our Rubb!),\" and he would then stand about the same length of time as he had spent in bowing. He would then prostrate himself and say, \"Subhana Rabbiyal-A'la (My Rubb the Supreme is free from imperfection),\" and his prostration lasted nearly the same length of time as his standing (Qiyam).<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"212","chapterTitle":"- باب فضل قيام الليل‏:‏","urn":1711650,"body":"<p>- وعن حذيفة رضي الله عنه، قال‏:‏ صليت مع النبي صلى الله عليه وسلم ، ذات ليلة فافتتح البقرة، فقلت‏:‏ يركع عند المائة، ثم مضى، فقلت‏:‏ يصلي بها في ركعة، فمضي، فقلت‏:‏ يركع بها، ثم افتتح النساء فقرأها، ثم افتتح آل عمران، فقرأها، يقرأ مترسلا‏.‏ إذا مر بآية فيها تسبيح سبح، وإذا بسؤال سأل، وإذا مر بتعوذ تعوذ، ثم ركع، فجعل يقول‏:‏ سبحان ربي العظيم، فكان ركوعه نحوًا من قيامه، ثم قال‏:‏ سمع الله لمن حمده، ربنا لك الحمد، ثم قام طويلا قريبًا مما ركع، ثم سجد فقال‏:‏ سبحان ربي الأعلى، فكان سجوده قريبًا من قيامه‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
