{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"20.00","hadithNumber":"175","hadith":[{"lang":"en","chapterNumber":"20","chapterTitle":"Calling to right guidance and forbidding depravity","urn":1601740,"body":"<p>Sahl bin Sa'd (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said on the day of the Khaibar Battle, \"I will give this banner to a person at whose hands Allah will grant victory; a man who loves Allah and His Messenger (ﷺ), and Allah and His Messenger love him also.\" The people spent the night thinking as to whom it would be given. When it was morning, the people hastened to Messenger of Allah (ﷺ). Every one of them was hoping that the banner would be given to him. He (the Prophet (ﷺ)) asked, \"Where is 'Ali bin Abu Talib?\" They said: \"O Messenger of Allah! His eyes are sore.\" He (ﷺ) then sent for him and when he came, Messenger of Allah (ﷺ) applied his saliva to his eyes and supplicated. 'Ali (May Allah be pleased with him) recovered as if he had no ailment at all. He (ﷺ) conferred upon him the banner. 'Ali (May Allah be pleased with him) said: ''O Messenger of Allah, shall I fight against them until they are like us?\" Thereupon he (the Prophet (ﷺ)) said, \"Advance cautiously until you reach their open places; thereafter, invite them to Islam and inform them what is obligatory for them from the Rights of Allah, for, by Allah, if Allah guides even one person through you that is better for you than possessing a whole lot of red camels\".<br/><br/><b>[Al- Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"20","chapterTitle":"- باب الدلالة على خير والدعاء إلى هدى أو ضلالة","urn":1701740,"body":"<p>- وعن العباس سهل بن سعد الساعدي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال يوم خيبر‏:‏ ‏\"‏لأعطين الراية غداً رجلا يفتح الله على يديه، يحب الله ورسوله، ويحبه الله ورسوله‏\"‏ فبات الناس يدوكون ليلتهم أيهم يعطاها‏.‏ فلما أصبح الناس غدوا على رسول الله صلى الله عليه وسلم‏:‏ كلهم يرجو أن يعطاها، فقال‏:‏ ‏\"‏أين علي بن أبى طالب‏؟‏‏\"‏ فقيل‏:‏ يا رسول الله هو يشتكي عينيه قال‏:‏ ‏\"‏فأرسلوا إليه‏\"‏ فأتي به ، فبصق رسول الله صلى الله عليه وسلم في عينيه، ودعا له، فبرأ حتى كأن لم يكن به وجع، فأعطاه الراية‏.‏ فقال علي رضي الله عنه ‏:‏ يا رسول الله أقاتلهم حتى يكونوا مثلنا‏؟‏ فقال‏:‏ ‏\"‏انفذ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم من حق الله تعالى فيه، فوالله لأن يهدي الله بك رجلاً واحداً خير لك من حمر النعم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏</p>","grades":[]}]}
