{"collection":"riyadussalihin","bookNumber":"3","chapterId":"117.00","hadithNumber":"781","hadith":[{"lang":"en","chapterNumber":"117","chapterTitle":"The Excellence of Wearing White Clothes and the Permissibility of Wearing Red, Green, Yellow and Black Clothes Made from Cotton and Linen but not Silk","urn":1607520,"body":"<p>Abu Juhaifah Wahb bin 'Abdullah (May Allah be pleased with him) reported: I saw the Prophet (ﷺ) by Al-Abtah valley in Makkah, in a red tent made from tanned skin. Bilal brought him ablution water. Then the Messenger of Allah (ﷺ) came out wearing a red mantle; and I can still remember looking at whiteness of his shanks. So he made his ablution, and Bilal (ﷺ) pronounced the call for prayer (Adhan). I kept following the movement of his (Bilal's) face to the right and to the left when he recited: 'Come to the prayer; come to the success.' Then a spear was fixed (as a Sutrah) in front of Messenger of Allah (ﷺ) who then stepped forward and led the prayer. Dogs and donkeys passed in front of him (beyond the spear) and no one prevented them from doing so.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"117","chapterTitle":"- باب استحباب الثوب الأبيض وجواز الأحمر والأخضر والأصفر والأسود وجوازه من قطن وكتان وشعر وصوف وغيرها إلا الحرير","urn":1707750,"body":"<p>- وعن أبى جحيفة وهب بن عبد الله رضى الله عنه قال‏:‏ رأيت النبي صلى الله عليه وسلم بمكة وهو بالأبطح في قبة له حمراء من آدم، فخرج بلال بوضوئه، فمن ناضح ونائل، فخرج النبي صلى الله عليه وسلم وعليه حلة حمراء، كأني أنظر إلى بياض ساقيه، فتوضأ وأذن بلال، فجعلت أتتبع فاه ههنا وههنا، يقول يمينا وشمالاً‏:‏ حي على الصلاة، حي على الفلاح، ثم ركزت له عنزة، فتقدم فصلى يمر بين يديه الكلب والحمار لا يمنع‏.((متفق عليه))</p>","grades":[]}]}
