{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"3.00","hadithNumber":"30","hadith":[{"lang":"en","chapterNumber":"3","chapterTitle":"Patience and Perseverance","urn":1600300,"body":"<p>Suhaib (May Allah be pleased with him) reported that the Messenger of Allah (ﷺ) said, \"There lived a king before you and he had a court magician. As he (the magician) grew old, he said to the king: 'I have grown old, so send me a young boy in order to teach him magic.' The king sent him a young boy to serve the purpose. And on his way (to the magician) the young boy met a monk to whom he listened to and liked it. It became his habit that on his way to the magician, he would meet the monk and sit there and would come to the magician (late). The magician used to beat him because of this delay. He complained about this to the monk who said to him: 'When you feel afraid of the magician, say: Members of my family detained me. And when you fear your family, say: The magician detained me.' It so happened that there came a huge beast and it blocked the way of the people, and the young boy said: 'I will know today whether the magician or the monk is better.' He picked up a stone and said: 'O Allah, if the way of the monk is dearer to You than the way of the magician, bring about death to the animal so that the people be able to move about freely.' He threw that stone at it and killed it and the people began to move about freely. He then came to the monk and told him the story. The monk said: 'Son, today you are superior to me. You have come to a stage where I feel that you would be soon put to a trial, and in case you are put to a trial, do not reveal me.' That young boy began to heal those born blind and the lepers and he, in fact, began to cure people from all kinds of illnesses. When a courtier of the king who had gone blind heard about him, he came to him with numerous gifts and said, 'If you cure me, all these things will be yours.' He said, 'I myself do not cure anyone. It is Allah, the Exalted, Alone Who cures; and if you affirm faith in Allah, I shall also supplicate to Allah to cure you.' This courtier affirmed his faith in Allah and Allah cured him. He came to the king and sat by his side as he used to sit before. The king said to him, 'Who restored your eyesight?' He said, 'My Rubb.' Thereupon he said, 'Do you have another lord besides me?' He said, 'My Rubb and your Rubb is Allah.' So the king kept torturing him untill he revealed the young boy. The young boy was thus summoned and the king said to him, 'O boy, it has been conveyed to me that you have become so much proficient in your magic that you cure the blind and the lepers and you do such and such.' Thereupon he said, 'I do not cure anyone; it is Allah Alone Who cures,' and the king took hold of him and began to torture him until he revealed of the monk. The monk was summoned and it was said to him: 'You should turn back from your religion.' But he refused. The king sent for a saw, placed it in the middle of his head and cut him into two parts that fell down. Then the courtier of the king was brought forward and it was said to him: 'Turn back from your religion.' He, too, refused, and the saw was placed in the midst of his head and he was torn into two parts. Then the boy was sent for and it was said to him: 'Turn back from your religion.' He refused. The king then handed him over to a group of his courtiers, and said to them: 'Take him to such and such mountain; make him climb up that mountain and when you reach its peak ask him to renounce his Faith. If he refuses to do so, push him to his death.' So they took him and made him climb up the mountain and he said: 'O Allah, save me from them in any way you like,' and the mountain began to shake and they all fell down (dead) and that young boy came walking to the king. The king said to him, 'What happened to your companions?' He said, 'Allah has saved me from them.' He again handed him to some of his courtiers and said: 'Take him and carry him in a boat and when you reach the middle of the sea, ask him to renounce his religion. If he does not renounce his religion throw him (into the water).' So they took him and he said: 'O Allah, save me from them.' The boat turned upside down and they all drowned except the young boy who came walking to the king. The king said to him, 'What happened to your companions?' He said, 'Allah has saved me from them,' and he said to the king: 'You cannot kill me until you do what I command you to do.' The king asked, 'What is that?' He said, 'Gather all people in one place and tie me up to the trunk of a tree, then take an arrow from my quiver and say: With the Name of Allah, the Rubb of the boy; then shoot me. If you do that you will be able to kill me.' 'The king called the people in an open field and tied the young boy to the trunk of a tree. He took out an arrow from his quiver, fixed in the bow and said, 'With the Name of Allah, the Rubb of the young boy,' he then shot the arrow and it hit the boy's temple. The young boy placed his hand upon the temple where the arrow had hit him and died. The people then said: 'We believe in the Rubb of this young boy.' The king was told: 'Do you see what you were afraid of, by Allah it has taken place; all people have believed.' The king then commanded that trenches be dug and fire lit in them, and said: 'He who would not turn back from his (the young boy's) religion, throw him in the fire' or 'he would be ordered to jump into it.' They did so till a woman came with her child. She felt hesitant in jumping into the fire. The child said to her: 'O mother! Endure (this ordeal) for you are on the Right Path\".<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"3","chapterTitle":"- باب الصبر","urn":1700300,"body":"<p>- وعن صهيب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ كان ملك فيمن كان قبلكم، وكان له ساحرٌ، فلما كبر قال للملك ‏:‏ إني قد كبرت فابعث إلى غلاماً أعلمه السحر؛ فبعث إليه غلاماً يعلمه، وكان في طريقه إذا سلك راهبٌ، فقعد إليه وسمع كلامه فأعجبه، وكان إذا أتى الساحر مر بالراهب وقعد إليه، فإذا أتى الساحر ضربه، فشكا ذلك إلى الراهب فقال‏:‏ إذا خشيت الساحر فقال‏:‏ حبسني أهلي، وإذا خشيت أهلك فقل‏:‏ حبسني الساحر‏.‏ \nفبينما هو على ذلك إذ أتى على دابةٍ عظيمةٍ قد حبست الناس فقال‏:‏ اليوم أعلم آلساحر أفضل أم الراهب أفضل‏؟‏ فآخذ حجراً فقال‏:‏ اللهم إن كان أمر الراهب أحب إليك من أمر الساحر فاقتل هذه الدابة حتى يمضي الناس، فرماها فقتلها ومضى الناس، فأتى الراهب فأخبره‏.‏ فقال له الراهب‏:‏ أي بني أنت اليوم أفضل مني، قد بلغ أمرك ما أرى، وإنك ستبتلى، فإن ابتليت فلا تدل علي؛ وكان الغلام يبرئ الأكمه والأبرص، ويداوي الناس من سائر الأدواء‏.‏ فسمع جليس للملك كان قد عمي، فأتاه بهدايا كثيرةٍ فقال‏:‏ ما هاهُنا لك أجمع إن أنت شفيتنى، فقال‏:‏ إني لا أشفي أحداً إنما يشفى الله تعالى، فإن آمنت بالله دعوت الله فشفاك، فآمن بالله تعالى فشفاه الله تعالى، فأتى الملك فجلس إليه كما كان يجلس فقال له الملك‏:‏ من ردّ عليك بصرك‏؟‏ فقال‏:‏ ربي قال‏:‏ ولك رب غيري ‏؟‏‏(‏ قال‏:‏ ربي وربك الله، فأخذه فلم يزل يعذبه حتى دل على الغلام، فجئ بالغلام فقال له الملك‏:‏ أى بني قد بلغ من سحرك ما تبرئ الأكمه والأبرص وتفعل وتفعل فقال‏:‏ إني لا أشفي أحداً، إنما يشفي الله تعالى، فأخذه فلم يزل يعذبه حتى دل على الراهب؛ فجيء بالراهب فقيل له‏:‏ ارجع عن دينك، فأبى ، فدعا بالمنشار فوضع المنشار في مفرق رأسه، فشقه حتى وقع شقاه، ثم جيء بجليس الملك فقيل له‏:‏ ارجع عن دينك فأبى، فوضع المنشار في مفرق رأسه، فشقه به حتى وقع شقاه، ثم جيء بالغلام فقيل له ارجع عن دينك فأبى، فدفعه إلى نفر من أصحابه فقال‏:‏ اذهبوا به إلى جبل كذا وكذا فاصعدوا به الجبل فقال‏:‏ اللهم اكفنيهم بما شئت، فرجف بهم الجبل فسقطوا، وجاء يمشي إلى الملك، فقال له الملك‏:‏ ما فعل أصحابك‏؟‏ فقال‏:‏ كفانيهم الله تعالى، فدفعه إلى نفر من أصحابه فقال ‏:‏ اذهبوا به فاحملوه في قرقور وتوسطوا به البحر، فإن رجع عن دينه وإلا فاقذفوه، فذهبوا به فقال‏:‏ اللهم اكفنيهم بما شئت، فانكفأت بهم السفينة فغرقوا، وجاء يمشي إلى الملك‏.‏ فقال له الملك ‏:‏ ما فعل أصحابك‏؟‏ فقال‏:‏ كفانيهم الله تعالى‏.‏ فقال الملك إنك لست بقاتلي حتى تفعل ما آمرك به‏.‏ قال ‏:‏ ما هو‏؟‏ قال ‏:‏ تجمع الناس في صعيد واحد، وتصلبني على جذع ، ثم خذ سهماً من كنانتي، ثم ضع السهم في كبد القوس ثم قل‏:‏ بسم الله رب الغلام ثم ارمني، فإنك إن فعلت ذلك قتلتني ‏.‏ فجمع الناس في صعيد واحد، وصلبه على جذع، ثم أخذ سهما من كنانته، ثم وضع السهم في كبد القوس، ثم قال‏:‏ بسم الله رب الغلام، ثم رماه فوقع السهم في صدغه، فوضع يده في صدغه فمات‏.‏ فقال الناس آمنا برب الغلام، فأتى الملك فقيل له‏:‏ أرأيت ما كنت تحذر قد والله نزل بك حذرك‏.‏ قد آمن الناس‏.‏ فأمر بالأخدود بأفواه السكك فخدت وأضرم فيها النيران وقال‏:‏ من لم يرجع عن دينه فأقحموه فيها أو قيل له ‏:‏ اقتحم ، ففعلوا حتى جاءت امرأة ومعها صبى لها، فتقاعست ان تقع فيها، فقال لها الغلام‏:‏ يا أماه اصبري فإنك على الحق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
