{"collection":"riyadussalihin","bookNumber":"15","chapterId":"244.00","hadithNumber":"1414","hadith":[{"lang":"en","chapterNumber":"244","chapterTitle":"The Excellence of the Remembrance of Allah","urn":1612810,"body":"<p>Sa'd bin Abu Waqqas (May Allah be pleased with him) reported: A bedouin came to the Messenger of Allah (ﷺ) and said to him, \"Teach me a few words to recite frequently.\" He (ﷺ) said, \"Say: \"La ilaha illallahu wahdahu la sharika lahu; Allahu Akbar kabiran, wal-hamdu lillahi kathiran, wa subhan-Allahi Rabbil-'alamin; wa la hawla wa la quwwata illa billahil-'Azizil-Hakim (there is no true god except Allah the One and He has no partner with Him; Allah is the Greatest and greatness is for Him. All praise is due to Him. Allah, the Rubb of the worlds is free from imperfection; there is no might and power but that of Allah, the All-Powerful and the All-Wise.)\"' The bedouin said: \"All of these for my Rubb. But what is for me?\" Thereupon he (Messenger of Allah (ﷺ)) said, \"You should say: 'Allahummaghfir li, warhamni, wahdini, warzuqni (O Allah! Grant me pardon, have mercy upon me, direct me to righteousness and provide me subsistence)'.\"<br/><br/><b>[Muslim]</b>.</p>","grades":[]},{"lang":"ar","chapterNumber":"244","chapterTitle":"- باب فضل الذكر والحث عليه","urn":1714040,"body":"<p>- وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال‏:‏ علمني كلامًا أقوله‏.‏ قال‏:‏ ‏\"‏قل لا إله إلا الله وحده لا شريك له، الله أكبر كبيرا والحمد لله كثيرا وسبحان الله رب العالمين، ولا حول ولا قوة إلا بالله العزيز الحكيم” قال فهؤلاء لربي، فما لي‏؟‏ قال‏:‏ ‏\"‏قل اللهم اغفر لي، وارحمني، واهدني، وارزقني‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏</p>","grades":[]}]}
