{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"519","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1605160,"body":"<p>Jabir (May Allah be pleased with him) reported: On the day of the battle of Al-Khandaq (the Trench), we were digging the trench when a very hard boulder came in our way. The Companions went to Messenger of Allah (ﷺ) and told him about it. He said, \"I will go down the trench to see it.\" He stood up and it was noticed that he had tied a stone over his stomach due to intense hunger. We had not tasted anything for three days. He took up a spade and struck the hard rock with it and it turned into sand. I sought his permission to go home, (after reaching home I) said to my wife, \"I have seen the Prophet (ﷺ) in a state that I am unable to endure. Have you got anything in the house?\" She said, \"I have a small quantity of barley and a lamb.\" I slaughtered the lamb, ground the barley and put the meat in the cooking pot. Then I went to the Prophet (ﷺ). In the meantime the flour had been kneaded and the meat in the pot was nearly cooked. I said to him, \"O Messenger of Allah, I have some food, will you come along with one or two Companions?\" He asked, \"How many men should go there?\" I told him the number. He said, \"It will be better if they are more in number. Tell your wife not to remove the pot from the hearth nor the bread from the oven till I arrive.\" Then he said to the Muhajirun and the Ansar: \"Let us go (to eat).\" They all rose (and went with him). I went to my wife and said, \"Bless you, the Prophet (ﷺ), the Muhajirun, the Ansar and the whole company are coming.\" She said, \"Did he (ﷺ) ask you?\" I replied in the affirmative. (When they arrived) Messenger of Allah (ﷺ) said to his Companions, \"Enter, but do not crowd in.\" Then he started breaking up the bread and putting meat on it. He would take from the pot and the oven then would cover them up, approach his Companions and hand it over to them. He would then go back and uncover the pot and the oven. He continued to break up the bread and put meat on it till all had eaten to their fill and still some of the food remained. Then he said to my wife, \"Eat from it, and send it as a present, for the people have been afflicted with severe hunger.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>Another narration is: Jabir said: When the trench was being dug, I noticed the signs of hunger on the face of the Prophet (ﷺ). I returned to my wife and said to her, \"Have you got anything in the house? I have seen the signs of severe hunger on the face of Messenger of Allah (ﷺ).\" She brought out a bag which contained a Sa' (a measure that equals approximately 3kg.) of barley. We had a lamb which was reared in the home. I slaughtered the lamb and she ground the flour for baking bread. I then cut the meat and put it in the cooking pot. When I was returning to Messenger of Allah (ﷺ), my wife said to me, \"Do not embarass me before Messenger of Allah (ﷺ) and his Companions.\" (She said this because she thought that the food would not be enough for everyone, for how can very little food cater for a thousand people?) When I came to him, I said to him in a low tone, \"O Messenger of Allah (ﷺ), we have slaughtered a small lamb and have ground a Sa' of barley. Please accompany me with a few of your Companions.\" Thereupon he (ﷺ) announced in a loud voice, \"O people of the Trench, Jabir has arranged a feast for you, so all of you are welcome.\" And addressing me he said, \"Do not take the pot off the fire, nor bake the kneaded flour till I arrive.\" So I came home and he came ahead of the people. My wife said, \"It will be a matter of disgrace for you (because there is not enough food).\" I said, \"I did only what you told me.\" She brought out the kneaded flour and Messenger of Allah (ﷺ) spat into it, and invoked the blessing of Allah on it, and then he spat into the cooking pot and invoked the blessing of Allah on it. Then he said, \"Call another woman to help bake bread and let her take out from the cooking pot, but do not take it off the fire.\" There were about a thousand guests. All of them ate till they left the food and went off. Our pot still bubbled as before and the dough was being baked as before.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1705150,"body":"<p>- وعن جابر رضي الله عنه قال‏:‏ إنا كنا يوم الخندق نحفر، فعرضت كدية شديدة، فجاؤوا إلى النبي صلى الله عليه وسلم فقالوا‏:‏ هذه كدية عرضت في الخندق‏.‏ فقال‏:‏ ‏\"‏أنا نازل‏\"‏ ثم قام، وبطنه معصوب بحجر، ولبثنا ثلاثة أيام لا نذوق ذوقاً فأخذ النبي صلى الله عليه وسلم المعول، فضرب، فعاد كثيباً أهيل، أو أهيم، فقلت‏:‏ يا رسول الله ائذن لي إلى البيت، فقلت لامرأتي‏:‏ رأيت بالنبي صلى الله عليه وسلم شيئاً ما في ذلك صبر فعندك شيء‏؟‏ فقالت‏:‏ عندي شعير وعناق، فذبحت العناق وطحنت الشعير حتى جعلنا اللحم في البرمة، ثم جئت النبي صلى الله عليه وسلم والعجين قد انكسر، والبرمة بين الأثاقي قد كادت تنضج، فقلت‏:‏ طعيم لي، فقم أنت يا رسول الله ورجل أو رجلان، قال‏:‏ ‏\"‏كم هو‏؟‏‏\"‏ فذكرت له فقال‏:‏ ‏\"‏كثير طيب، قل لها لا تنزع البرمة، ولا الخبز من التنور حتى آتي” فقال‏:‏ “قوموا” فقام المهاجرون والأنصار، فدخلت عليها فقلت‏:‏ ويحك جاء النبي صلى الله عليه وسلم والمهاجرون والأنصار ومن معهم‏!‏ قالت‏:‏ هل سألك‏؟‏ قلت‏:‏ نعم، قال‏:‏ “ادخلوا ولا تضاغطوا فجعل يكسر الخبز، ويجعل عليه اللحم، ويخمر البرمة والتنور إذا أخذ منه، ويقرب إلى أصحابه ثم ينزع، فلم يزل يكسر ويغرف حتى شبعوا، وبقي منه، فقال‏:‏ كلي هذا وأهدي، فإن الناس أصابتهم مجاعة” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \n<br/>\nوفي رواية‏:‏ قال جابر‏:‏ لما حفر الخندق رأيت النبي صلى الله عليه وسلم خمصاً، فانكفأت إلى امراتى فقلت‏:‏ هل عندك شيء؛ فإني رأيت برسول الله صلى الله عليه وسلم خمصاً شديداً فأخرجت إلي جرابا فيه صاع من شعير، ولنا بهيمة داجن فذبحتها، وطحنت الشعير، ففرغت إلى فراغى، وقطعتها في برمتها، ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت‏:‏ لا تفضحني برسول الله صلى الله عليه وسلم ومن معه، فجئته وساررته فقلت‏:‏ يا رسول الله، ذبحنا بهيمة لنا، وطحنت صاعا من شعير، فتعال أنت ونفر معك، فصاح رسول الله صلى الله عليه وسلم فقال‏:‏ يا أهل الخندق إن جابراً قد صنع سؤراً فحيهلا بكم‏\"‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏لا تنزلن برمتكم ولا تخبزن عجينكم حتى أجيء‏\"‏ فجئت، وجاء النبي صلى الله عليه وسلم يقدم الناس، حتى جئت امرأتي فقالت‏:‏ بك وبك‏!‏ فقلت‏:‏ قد فعلت الذي قلت‏.‏ فأخرجت عجيناً، فبسق فيه وبارك، ثم عمد إلى برمتنا فبصق وبارك، ثم قال‏:‏ ‏\"‏ادعي خابزة فلتخبز معك، واقدحي من برمتكم ولا تنزلوها‏\"‏وهم ألف، فأقسم بالله لأكلوا حتى تركوه وانحرفوا، وإن برمتنا لتغط كما هي، وإن عجيننا ليخبز كما هو‏.‏\n<br/>\nقوله‏:‏ ‏\"‏عرضت كدية‏\"‏ ‏:‏ بضم الكاف وإسكان الدال وبالياء المثناة تحت؛ وهي قطعة غليظة صلبة من الأرض لا يعمل فيها الفأس‏.‏ ‏\"‏والكثيب‏\"‏ أصله تل الرمل، والمراد هنا‏:‏ صارت تراباً ناعماً، وهو معنى “أهيل”‏.‏ ‏\"‏الأثافي‏\"‏ ‏:‏ الأحجار التى يكون عليها القدر‏.‏ و‏\"‏تضاغطوا‏\"‏ ‏:‏ تزاحموا‏.‏ و‏\"‏المجاعة‏\"‏ ‏:‏الجوع، وهو بفتح الميم‏.‏ و‏\"‏الخمص‏\"‏ بفتح الخاء المعجمة والميم‏:‏ الجوع‏.‏ و”انكفأت” ‏:‏ انقلبت ورجعت‏.‏ ‏\"‏البهيمة‏\"‏ بضم الباء‏:‏ تصغير بهمة، وهي العناق -بفتح العين-‏.‏ و‏\"‏الداجن‏\"‏‏:‏ هي التي ألفت البيت‏.‏ و‏\"‏السؤر‏\"‏ ‏:‏الطعام الذي يدعى الناس إليه، وهو بالفارسية‏.‏ و‏\"‏حيهلا‏\"‏ أي‏:‏ تعالوا‏.‏ وقولها‏:‏ ‏\"‏بك وبك‏\"‏ أي‏:‏ خاصمته وسبته، لأنها اعتقدت أن الذي عندها لا يكفيهم، فاستحيت وخفي عليها ما أكرم الله سبحانه وتعالى به نبيه صلى الله عليه وسلم من هذه المعجزة الظاهرة والآية اباهرة‏.‏ “بسق‏\"‏ أي ‏:‏بصق؛ ويقال أيضاً‏:‏ بزق -ثلاث لغات- و‏\"‏عمد‏\"‏ بفتح الميم‏:‏ أي قصد‏.‏ و‏\"‏اقدحي” أي اغرفي؛ والمقدحة‏:‏ المغرفة‏.‏ و”تغط” أي‏:‏ لغليانها صوت، والله اعلم‏.‏</p>","grades":[]}]}
