{"collection":"riyadussalihin","bookNumber":"8","chapterId":"193.00","hadithNumber":"1077","hadith":[{"lang":"en","chapterNumber":"193","chapterTitle":"Strict Orders for Observance of Obligatory Salat","urn":1621200,"body":"<p>Mu'adh (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) sent me as a governor to Yemen and (at the time of departure) he instructed me thus: \"You will go to people of the Scripture (i.e., the Jews and the Christians). First of all invite them to testify that La ilaha ill Allah (There is no true god except Allah) and that Muhammad (ﷺ) is His slave and Messenger; and if they accept this, then tell them that Allah has enjoined upon them five Salat (prayers) during the day and night; and if they accept it, then tell them that Allah has made the payment of Zakat obligatory upon them. It should be collected from their rich and distributed among their poor; and if they agree to it, don't take (as a share of Zakat) the best of their properties. Beware of the supplications of the oppressed, for there is no barrier between it and Allah.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"193","chapterTitle":"- باب الأمر بالمحافظة على الصلوات المكتوبات والنهي الأكيد والوعيد الشديد في تركهن‏:‏","urn":1710670,"body":"<p>- وعن معاذ رضي الله عنه قال‏:‏ بعثني رسول الله صلى الله عليه وسلم إلى اليمن فقال‏:‏ ‏\"‏إنك تأتي قومًا من أهل الكتاب، فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله، فإن هم أطاعوا لذلك، فأعلمهم أن الله تعالى افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك، فأعلمهم أن الله تعالى افترض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم، فإن هم اطاعوا لذلك، فإياك وكرائم أموالهم واتقِ دعوة المظلوم فإنه ليس بينها وبين الله حجاب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏</p>","grades":[]}]}
