{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"67.00","hadithNumber":"586","hadith":[{"lang":"en","chapterNumber":"67","chapterTitle":"Abomination of longing for Death","urn":1605800,"body":"<p>Qais bin Abu Hazim (May Allah be pleased with him) reported: I went to visit Khabbab bin Aratt (May Allah be pleased with him) during his illness. He had been cauterized in seven places. He said: \"Our companions who have died have left (this world) without having enjoyed the pleasures of the world (in order to get a great full reward in the Hereafter) while we have amassed wealth exceeding our needs for which there is no place to keep except in the earth. Had Messenger of Allah (ﷺ) not prohibited us from longing for death, I would have prayed for it.\" Then we visited him again and he was building a wall. He said: \"There is a reward in store for a Muslim in respect of everything on which he spends except for something he places in the earth (i.e., something exceeding our needs or essentials).\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"67","chapterTitle":"- باب كراهة تمنى الموت بسبب ضر نزل به ولا بأس به لخوف الفتنة فى الدين","urn":1705820,"body":"<p>- وعن قيس بن أبي حازم قال‏:‏ دخلنا على خباب بن الأرت رضي الله عنه نعوده وقد اكتوى سبع كيات فقال‏:‏ إن أصحابنا الذين سلفوا مضوا، ولم تنقصهم الدنيا، وإنا أصبنا ما لا نجد له موضعاً إلا التراب ولولا أن النبي صلى الله عليه وسلم نهاناً أن ندعوا بالموت لدعوت به، ثم أتيناه مرة أخرى وهو يبنى حائطاً له فقال‏:‏ إن المسلم ليؤجر فى كل شئ ينفقه إلا فى شئ يجعله فى هذا التراب‏.‏ ‏(‏‏(‏متفق عليه وهذا لفظ رواية البخاري‏)‏‏)‏‏.‏</p>","grades":[]}]}
