{"collection":"riyadussalihin","bookNumber":"17","chapterId":"290.00","hadithNumber":"1622","hadith":[{"lang":"en","chapterNumber":"290","chapterTitle":"Prohibition of gazing at women and Beardless Handsome Boys except in Exigency","urn":1624230,"body":"<p>Abu Hurairah (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"Allah has written the very portion of Zina which a man will indulge in. There will be no escape from it. The Zina of the eye is the (lustful) look, the Zina of the ears is the listening (to voluptuous songs or talk), the Zina of the tongue is (the licentious) speech, the Zina of the hand is the (lustful) grip, the Zina of the feet is the walking (to the place where he intends to commit Zina), the heart yearns and desires and the private parts approve all that or disapprove it.\"<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>This is the wording in Muslim; Al-Bukhari wording is a bit short.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"290","chapterTitle":"- باب تحريم النظر إلى المرأة الأجنبية والأمرد الحسن لغير حاجة شرعية","urn":1716120,"body":"<p>- وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏كُتب على ابن آدم نصيبه من الزنا مدرك ذلك لا محالة‏:‏ العينان زناهما النظر، والأذنان زناهما الاستماع، واللسان زناه الكلام، واليد زناها البطش، والرجل زناها الخطا، والقلب يهوى ويتمنى، ويصدق ذلك الفرج أو يكذبه‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏.‏ وهذا لفظ مسلم، ورواية البخاري مختصرة‏)‏‏)‏‏.‏</p>","grades":[]}]}
