{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"25.00","hadithNumber":"202","hadith":[{"lang":"en","chapterNumber":"25","chapterTitle":"Discharging the Trusts","urn":1602000,"body":"<p>Abu Khubaib 'Abdullah bin Az-Zubair (May Allah bepleased with them) reported: When Az-Zubair, got ready to fight in the battle of Al- Jamal, he called me and said: \"My son, whoever is killed today will be either a wrongdoer or a wronged one. I expect that I shall be the the wronged one today. I am much worried about my debt. Do you think that anything will be left over from our property after the payment of my debt? My son, sell our property and pay off my debt.\" Az-Zubair then willed one-third of that portion to his sons; namely 'Abdullah's sons. He said, \"One-third of the one-third. If any property is left after the payment of debts, one-third (of the one-third of what is left is to be given to your sons.\" (Hisham, a subnarrator added: \"Some of the sons of 'Abdullah were equal in age to the sons of Az-Zubair, e.g., Khubaib and Abbad. 'Abdullah had nine sons and nine daughters at that time)\". (The narrator 'Abdullah added:) He kept on instructing me about his debts and then said: \"My son, should you find yourself unable to pay any portion of my debt then beseech my Master for His help.\" By Allah, I did not understand what he meant and asked: \"Father, who is your Master?\" He said: \"Allah.\" By Allah! Whenever I faced a difficulty in discharging any portion of his debt; I would pray: \"O Master of Zubair, discharge his debt,\" and He discharged it. Zubair was martyred. He left no money, but he left certain lands, one of them in Al-Ghabah, eleven houses in Al-Madinah, two in Basrah, one in Kufah and one in Egypt. The cause of his indebtedness was that a person would come to him asking him to keep some money of his in trust for him. Zubair would refuse to accept it as a trust, fearing it might be lost, but would take it as a loan. He never accepted a governorship, or revenue office, or any public office. He fought along with Messenger of Allah (ﷺ) and Abu Bakr, 'Umar and 'Uthman (May Allah be pleased with them).<br/><br/>'Abdullah added: I prepared a statement of his debts and they amounted to two million and two hundred thousand! Hakim bin Hizam met me and asked me: \"Nephew, how much is due from my brother as debt?\" I kept it as secret and said: \"A hundred thousand.\" Hakim said: \"By Allah! I do not think your assets are sufficient for the payment of these debts.\" I said: \"What would you think if the amount were two million and two hundred thousand?\" He said: \"I do not think that you would be able to clear off the debts. If you find it difficult let me know.\"<br/><br/>Az-Zubair (May Allah bepleased with him) had purchased the land in Al-Ghabah for a hundred and seventy thousand. 'Abdullah sold it for a million and six hundred thousand, and declared that whosoever had a claim against Az-Zubair (May Allah bepleased with him) should see him in Al-Ghabah. 'Abdullah bin Ja'far (May Allah bepleased with him) came to him and said: \"Az- Zubair (May Allah bepleased with him) owed me four hundred thousand, but I would remit the debt if you wish.\" 'Abdullah (May Allah bepleased with him) said: \"No.\" Ibn Ja'far said: ''If you would desire for postponement I would postpone the recovery of it.\" 'Abdullah said: \"No.\" Ibn Ja'far then said: \"In that case, measure out a plot for me.\" 'Abdullah marked out a plot. Thus he sold the land and discharged his father's debt. There remained out of the land four and a half shares. He then visited Mu'awiyah who had with him at the time 'Amr bin 'Uthman, Al-Mundhir bin Az-Zubair and Ibn Zam'ah (May Allah bepleased with them). Mu'awiyah (May Allah bepleased with him) said: \"What price did you put on the land in Al-Ghabah?\" He said: \"One hundred thousand for a each share. Mu'awiyah inquired: \"How much of it is left?\" 'Abdullah said: \"Four and a half shares.\" Al-Mundhir bin Az-Zubair said: \"I will buy one share for a hundred thousand\". 'Amr bin 'Uthman said: \"I will buy one share for a hundred thousand\". Ibn Zam'ah said: \"I will buy one share for a hundred thousand.\" Then Mu'awiyah asked: \"How much of it is now left?\" 'Abdullah said: \"One and a half share. Mu'awiyah said: \"I will take it for one hundred and fifty thousand.\" Later 'Abdullah bin Ja'far sold his share to Mu'awiyah for six hundred thousand.<br/><br/>When 'Abdullah bin Az-Zubair (May Allah bepleased with him) finished the debts, the heirs of Az-Zubair (May Allah bepleased with him) asked him to distribute the inheritance among them. He said: \"I will not do that until I announce during four successive Hajj seasons: 'Let he who has a claim against Az-Zubair come forward and we shall discharge it.\"' He made this declaration on four Hajj seasons and then distributed the inheritance among the heirs of Az-Zubair (May Allah bepleased with him) according to his will. Az- Zubair (May Allah bepleased with him) had four wives. Each of them received a million and two hundred thousand. Thus Az-Zubair's total property was amounted to fifty million and two hundred thousand.<br/><br/><b>[Al-Bukhari]</b></p>","grades":[]},{"lang":"ar","chapterNumber":"25","chapterTitle":"- باب الأمر بأداء الأمانة","urn":1702010,"body":"<p>- وعن أبي خُبيب -بضم الخاء المعجمة- عبد الله بن الزبير، رضي الله عنهما، قال‏:‏ لما وقف الزبير يوم الجمل دعاني فقمت إلى جنبه، فقال‏:‏ يا بني إنه لا يقتل اليوم إلا ظالم أو مظلوم ،وإني لا أرانى إلا سأقتل اليوم مظلوما، وإن من أكبر همي لديني، أفترى ديننا يبقي من مالنا شيئًا‏؟‏ ثم قال‏:‏ يا بني بع مالنا واقض ديني، وأوصى بالثلث وثلثه لبنيه، يعني لبني عبد الله بن الزبير ثلث الثلث‏.‏ قال فإن فضل من مالنا بعد قضاء الدين شيء فثلثه لبنيك ، قال هشام ‏:‏ وكان بعض ولد عبد الله قد وازى بعض بني الزبير خبيب وعباد، وله يومئذ تسعة بنين وتسع بنات‏.‏ قال عبد الله ‏:‏ فجعل يوصيني بدينه ويقول‏:‏ يا بنى إن عجزت عن شيء منه فاستعن عليه بمولاي‏.‏ قال فوالله ما دريت ما أراد حتى قلت‏:‏ يا أبت من مولاك‏؟‏ قال‏:‏ الله‏.‏ قال‏:‏ فوالله ما وقعت في كربةٍ من دينه إلا قلت‏:‏ يا مولى الزبير اقض عنه دينه، فيقضيه‏.‏ قال‏:‏ فقتل الزبير ولم يدع دينارًا ولا درهمًا إلا أرضين، منهما الغابة وإحدى عشرة دارًا بالمدينة، ودارين بالبصرة، ودارًا بالكوفة ودارًا بمصر‏.‏ قال‏:‏ وإنما كان دينه الذي كان عليه أن الرجل كان يأتيه بالمال، فيستودعه إياه، فيقول الزبير‏:‏ لا ولكن هو سلف إني أخشى عليه الضيعة‏.‏ وما ولي إمارة قط ولا جباية ولا خراجًا ولا شيئًا إلا أن يكون في غزو مع رسول الله صلى الله عليه وسلم، أو مع أبي بكر وعمر وعثمان رضي الله عنهم، قال عبد الله‏:‏ فحسبت ما كان عليه من الدين فوجدته ألفي ألف ومائتي ألف‏!‏ فلقى حكيم بن حزام عبد الله بن الزبير فقال‏:‏ يا ابن أخي كم على أخي من الدين‏؟‏ فكتمته وقلت ‏:‏ مائة ألف‏.‏ فقال حكيم‏:‏ والله ما أرى أموالكم تسع هذه ‏!‏ فقال عبد الله‏:‏ أرأيتك إن كانت ألف ألف‏؟‏ ومائتي ألف‏؟‏ قال‏:‏ ما أراكم تطيقون هذا، فإن عجزتم عن شيء منه فاستعينوا بي‏.‏ قال‏:‏ وكان الزبير قد اشترى الغابة بسبعين ومائة ألف، فباعها عبد الله بألف ألف وستمائة ألف ، ثم قام فقال‏:‏ من كان له على الزبير شيء فليوافنا بالغابة، فأتاه عبد الله بن جعفر، وكان له على الزبير أربعمائة ألف، فقال لعبد الله‏:‏ إن شئتم تركتها لكم‏؟‏ قال عبد الله‏:‏ لا، قال‏:‏ فإن شئتم جعلتموها فيما تؤخرون إن أخرتم، فقال عبد الله‏:‏ لا قال‏:‏ فاقطعوا لي قطعة، قال عبد الله‏:‏ لك من ههنا إلى ههنا‏.‏ فباع عبد الله منها، فقضى عنه دينه، وأوفاه وبقي منها أربعة أسهم ونصف، فقدم على معاوية وعنده عمرو بن عثمان، والمنذر بن الزبير، وابن زمعة فقال له معاوية‏:‏ كم قومت الغابة‏؟‏ قال ‏:‏ كل سهم بمائة ألف قال‏:‏ كم بقي منها‏؟‏ قال‏:‏ أربعة أسهم ونصف، فقال المنذر ابن الزبير‏:‏ قد أخذت منها سهمًا بمائة ألف، قال عمرو بن عثمان‏:‏ قد أخذت منها سهمًا بمائة ألف‏.‏ وقال ابن زمعة‏:‏ قد أخذت سهمًا بمائة ألف، فقال معاوية‏:‏ كم بقي منها‏؟‏ قال‏:‏ سهم ونصف سهم، قال‏:‏ قد أخذته بخمسين ومائة ألف ‏.‏ قال‏:‏ وباع عبد الله بن جعفر نصيبه من معاوية بستمائة ألف‏.‏ فلما فرغ ابن الزبير من قضاء دينه قال بنو الزبير ‏:‏ اقسم بيننا ميراثنا‏.‏ قال‏:‏ ‏:‏ والله لا أقسم بينكم حتى أنادي بالموسم أربع سنين ‏:‏ ألا من كان له على الزبير دين فليأتنا فلنقضه‏.‏ فجعل كل سنة ينادي في الموسم، فلما مضى أربع سنين قسم بينهم ودفع الثلث‏.‏ وكان للزبير أربع نسوة، فأصاب كل امراةٍ ألف ألف ومائتا ألف، فجميع ماله خمسون ألف ألف ومائتا ألف، رواه البخاري‏.‏</p>","grades":[]}]}
