{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"56.00","hadithNumber":"497","hadith":[{"lang":"en","chapterNumber":"56","chapterTitle":"Excellence of Simple Living and being Content with Little","urn":1604940,"body":"<p>Khalid bin 'Umar Al-'Adawi reported: 'Utbah bin Ghazwan, the governor of Basrah, delivered a Khutbah. He praised Allah, glorified Him, then said: \"Amma b'adu, verily, the world has been given the news of its end and is running to meet its end swiftly. Nothing is left out of it but a very little amount. Similar to the remainder in a dish whose owner is collecting it to drink; and you are going to move to an abode which knows no end, and you should proceed there with the good before you, for we have been informed (by the Prophet (ﷺ)) that a stone would be thrown at one side of the Hell and it would travel down for seventy years but would not reach its bottom. By Allah, it will be filled (with men and jinn). Do you find it strange? We have been informed (i.e., by the Prophet (ﷺ)) that the distance between two shutters of the gate of Jannah is forty years (distance). And a day would come when it would be fully packed; I was the seventh amongst the seven who had been with Messenger of Allah (ﷺ), and we had nothing to eat but the leaves of the tree until the sides of our mouth were injured. We found a sheet which we tore into two and divided between myself and Sa'd bin Malik. I made the lower garment with half of it and so did Sa'd. Today, there is none amongst us who has not become the governor of a city, and I seek refuge with Allah that I should consider myself great while I am insignificant to Allah.\"<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"56","chapterTitle":"-باب فضل الجوع وخشونة العيش والإقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات","urn":1704930,"body":"<p>- وعن خالد بن عمر العدوي قال‏:‏ خطبنا عتبة بن غزوان، وكان أمير على البصرة، فحمد الله وأثنى عليه، ثم قال‏:‏ أما بعد؛ فإن الدنيا قد آذنت بصرم، وولت حذاء، ولم يبق منها إلا صبابة كصبابة الإناء يتصابها صاحبها، وإنكم منتقلون منها إلى دار لا زوال لها، فانتقلوا بخير ما بحضرتكم، فإنه قد ذكر لنا أن الحجر يلقى من شفير جنهم فيهوي فيها سبعين عاماً، لا يدرك لها قعراً، والله لتملأن ‏.‏‏.‏‏.‏أفعجبتم‏!‏‏؟‏ ولقد ذكر لنا أن ما بين مصراعين من مصاريع الجنة مسيرة أربعين عاماً، وليأتين عليه يوم وهو كظيظ من الزحام، ولقد رأيتني سابع سبعة مع رسول الله، صلى الله عليه وسلم ما لنا طعام إلا ورق الشجر، حتى قرحت أشداقنا، فالتقطت بردة فشققتها بيني وبين سعد بن مالك، فاتزرت بنصفها، واتزر سعد بنصفها، فما أصبح اليوم منا أحد إلا أصبح أميراً على مصر من الأمصار، وإني أعوذ بالله أن أكون في نفسي عظيماً، وعند الله صغيراً‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏\n<br/>\n‏قوله‏:‏ ‏ ‏ آذنت‏ ‏ هو بمد الألف، أي: أعلمت‏.‏ وقوله‏:‏ ‏ ‏ بصرم‏ ‏‏:‏ هو بضم الصاد، أي بانقطاعها وفنائها‏.‏ وقوله ‏ ‏وولت حذاء‏ ‏ هو بحاء مهملة مفتوحة، ثم ذال معجمة مشددة، ثم ألف ممدودة، أي‏:‏ سريعة‏.‏ و‏ ‏الصبابة‏ ‏ بضم الصاد المهملة‏:‏ وهي البقية اليسيرة‏.‏ وقوله‏:‏ ‏ ‏ يتصابها‏ ‏ هو بتشديد الباء قبل الهاء، أي‏:‏ يجمعها‏.‏ و‏ ‏ الكظيظ‏ ‏‏:‏ الكثير الممتليء‏.‏ وقوله‏:‏ ‏ ‏ قرحت‏ ‏ هو بفتح القاف وكسر الراء، أي‏:‏ صارت فيها قروح‏.</p>","grades":[]}]}
