{"collection":"riyadussalihin","bookNumber":"1","chapterId":"95.00","hadithNumber":"708","hadith":[{"lang":"en","chapterNumber":"95","chapterTitle":"Excellence of Conveying Glad Tidings and Congratulations","urn":1606980,"body":"<p>Abu Musa Al-Ash'ari (May Allah be pleased with him) reported: One day, I performed my Wudu' in my house and then set forth with the determination that I would stick to Messenger of Allah (ﷺ) and spend the whole day with him. I came to the mosque and asked about him. The Companions told that he (ﷺ) had gone in a certain direction. Abu Musa added: I followed him inquiring until I came to Bi'r Aris (a well in the suburb of Al-Madinah). (There) I sat down at the door till he (ﷺ) had relieved himself and performed Wudu'. Then I went to him and saw him sitting on the platform of the well with his shanks uncovered and his legs dangling in the well. I greeted him and returned to the door of the garden, saying to myself, \"I will be the doorkeeper of the Messenger of Allah (ﷺ) today.\" Abu Bakr (May Allah be pleased with him) came and knocked at the door. I said; \"Who is that?\" He said: \"Abu Bakr.\" I said, \"Wait a moment.\" Then I went to the Messenger of Allah (ﷺ) and said, \"O Messenger of Allah! Abu Bakr is at the door seeking permission to enter.\" He said, \"Admit him and give him the glad tidings of Jannah.\" I returned and said to Abu Bakr (May Allah be pleased with him): \"You may enter and Messenger of Allah (ﷺ) has given you the glad tidings of (entering) Jannah.\" Abu Bakr (May Allah be pleased with him) came in and sat down on the right side of Messenger of Allah (ﷺ) and suspended his legs into the well and uncovered his shanks, as the Messenger of Allah (ﷺ) had done. I returned to the door and sat down. I had left my brother at home while he was performing Wudu' and intending to join me. I said to myself: \"If Allah intends good for him (i.e., to be blessed to come at this time and receive the glad tidings of entering Jannah), He will bring him here.\" Someone knocked at the door and I said, \"Who is it?\" He said, \"Umar bin Al-Khattab.\" I said, \"Wait a moment.\" Then I proceeded towards Messenger of Allah (ﷺ). I greeted him and said, \"Umar is at the door, seeking permission to enter. He said, \"Let him in and give him the glad tidings of entering Jannah.\" I went back to 'Umar (May Allah be pleased with him) and said to him, \"Messenger of Allah has given you permission as well as glad tidings of entering Jannah.\" He entered and sat down with Messenger of Allah (ﷺ) on his left side and dangled his feet into the well. I returned to the door and sat down and said to myself: \"If Allah intends good for my brother, He will bring him here.\" Someone knocked at the door and I said, \"Who is it?\" He said, \"Uthman bin 'Affan.\" I said, \"Wait a moment.\" I went to Messenger of Allah (ﷺ) and informed him about his arrival. He said, \"Let him in and give him glad tidings of entering Jannah together with a tribulation which he will have to face.\" I came back to him and said, \"You may enter; and Messenger of Allah (ﷺ) gives you the glad tidings of entering Jannah together with a tribulation that will afflict you.\" He got in and saw that the elevated platform round the well was fully occupied. So he sat on opposite side. Sa'id bin Al- Musaiyab (May Allah be pleased with him) a subnarrator has reported: The order in which they sat down indicated the places of their burial.<br/><br/><b>[Al-Bukhari and Muslim]</b>.<br/><br/>Another narration adds: Abu Musa Al-Ash'ari (May Allah be pleased with him) said: The Prophet (ﷺ) ordered me to guard the door. When 'Uthman was told (about the misfortune) he praised Allah then said: \"Allahu Musta'an (His help is to be sought).\"<br/><br/>(The interpretation of Sa'id bin Al-Musaiyab is that the graves of Abu Bakr and 'Umar (May Allah be pleased with them) are by the side of the Prophet (ﷺ), in the same position they took when they sat next to the Prophet (ﷺ) while the grave of 'Uthman is away from their graves, in the public graveyard of Al-Madinah known as Baqi' Al-Gharqad).<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"95","chapterTitle":"- باب استحباب التبشير والتهنئة بالخير","urn":1707040,"body":"<p>- وعن أبي موسى الأشعري رضي الله عنه ، أنه توضأ في بيته، ثم خرج فقال‏:‏ لألزمن رسول الله صلى الله عليه وسلم ، ولأكونن معه يومي هذا، فجاء المسجد، فسأل عن النبي صلى الله عليه وسلم الله عليه وسلم ، فقالوا‏:‏ وجه ههنا، قال‏:‏ فخرجت على أثره أسأل عنه ، حتى دخل بئر أريس، فجلست عند الباب حتى قضى رسول الله صلى الله عليه وسلم حاجته وتوضأ، فقمت إليه، فإذا هو قد جلس على بئر أريس وتوسط قفها، وكشف عن ساقيه ودلاهما في البئر، فسلمت عليه ثم انصرفت، فجلست عند الباب فقلت‏:‏ لأكونن بواب رسول الله صلى الله عليه وسلم اليوم، فجاء أبو بكر رضي الله عنه فدفع الباب فقلت‏:‏ من هذا‏؟‏ فقال‏:‏ أبو بكر، فقلت على رسلك، ثم ذهبت فقلت‏:‏ يا رسول الله هذا أبو بكر يستأذن، فقال‏:‏ ‏\"‏ائذن له وبشره بالجنة‏\"‏ فأقلبت حتى قلت لأبي بكر‏:‏ ادخل ورسول الله يبشرك بالجنة، فدخل أبو بكر حتى جلس عن يمين النبي صلى الله عليه وسلمى الله عليه وسلم معه في القف، ودلى رجليه في البئر كما صنع رسول الله صلى الله عليه وسلم ، وكشف عن ساقيه، ثم رجعت وجلست، وقد تركت أخي يتوضأ ويلحقني ، فقلت‏:‏ إن يرد الله بفلان -يرد أخاه- خيراً يأت به، فإذا إنسان يحرك الباب، فقلت‏:‏ من هذا‏؟‏ فقال‏:‏ عمر بن الخطاب‏:‏ فقلت‏:‏ على رسلك ، ثم جئت إلى رسول الله صلى الله عليه وسلم ، فسلمت عليه وقلت‏:‏ هذا عمر يستأذن‏؟‏ فقال‏:‏”ائذن له وبشره بالجنة‏\"‏ فجئت عمر، فقلت‏:‏ أذن ويبشرك رسول الله صلى الله عليه وسلم بالجنة، فدخل فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره، ودلى رجليه في البئر، ثم رجعت فجلست فقلت‏:‏ إن يرد الله بفلان خيراً -يعني أخاه- يأت به، فجاء إنسان فحرك الباب‏.‏ فقلت‏:‏ من هذا ‏؟‏ فقال‏:‏ عثمان بن عفان فقلت‏:‏ على رسلك، وجئت النبي صلى الله عليه وسلم الله عليه وسلم ، فأخبرته فقال‏:‏ ‏\"‏ائذن له وبشره بالجنة مع بلوى تصيبه‏\"‏ فجئت فقلت له‏:‏ ادخل ويبشرك رسول الله صلى الله عليه وسلم بالجنة مع بلوى تصيبك، فدخل فوجد القف قد ملئ، فجلس وجاههم من الشق الآخر‏.‏ قال سعيد بن المسيب‏:‏ فأولتها قبورهم ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوزاد في رواية‏:‏ “وأمرني رسول الله صلى الله عليه وسلم بحفظ الباب‏.‏ وفيها أن عثمان حين بشره حمد الله تعالى، ثم قال‏:‏ الله المستعان‏.‏</p>","grades":[]}]}
