{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"7.00","hadithNumber":"78","hadith":[{"lang":"en","chapterNumber":"7","chapterTitle":"Firm Belief and Perfect Reliance on Allah","urn":1600775,"body":"<p>Jabir (May Allah be pleased with him) reported: I went in an expedition along with the Prophet (ﷺ) in the direction of Najd. When Messenger of Allah (ﷺ) returned, I also returned with him. Then the mid-day sleep overtook us in a valley full of prickly shrubs. Messenger of Allah (ﷺ) got down and the people scattered around seeking shade under the trees. Messenger of Allah (ﷺ) hang up his sword on the branch of a tree. We were enjoying a sleep when Messenger of Allah (ﷺ) called us, and lo! There was a desert Arab bedouin near him. He (ﷺ) said, \"This man brandished my sword over me while I was asleep. I woke up and saw it in his hand unsheathed. He asked: `Who will protect you from me?' I replied: 'Allah' - thrice\". He did not punish him and sat down.\n</p>\n<p>\n<b>[Al-Bukhari and Muslim]</b>.\n</p>\n<p>\nIn another narration, Jabir (May Allah be pleased with him) said: We accompanied Messenger of Allah (ﷺ) in the campaign of Dhat-ur-Riqa`. We left Messenger of Allah (ﷺ) to take rest under a shady tree. One of the polytheists came to him. The sword of Messenger of Allah (ﷺ) was hanging on a tree. He drew it and said: \"Are you afraid of me?'' Messenger of Allah (ﷺ) said, \"No\". Then he said: \"Who will then protect you from me?'' Messenger of Allah (ﷺ) replied, \"Allah\".\n</p>\n<p>\nAnd in a narration of Abu Bakr Al-Isma`ili, the polytheist asked: \"Who will protect you from me?'' Messenger of Allah (ﷺ) replied, \"Allah.'' As soon as he said this, the sword fell down from his hand and Messenger of Allah (ﷺ) catching the sword, asked him, \"Who will protect you from me.'' He said, \"Please forgive me.'' Messenger of Allah (ﷺ) said, \"On condition you testify that there is none worthy of worship but Allah and that I am His Messenger.'' He said, \"No, but I promise you that I shall not fight against you, nor shall I be with those who fight with you\". The Prophet (ﷺ) let him go. He then went back to his companions and said: \"I have come to you from one of the best of mankind\".</p>","grades":[]},{"lang":"ar","chapterNumber":"7","chapterTitle":"- باب اليقين والتوكل","urn":1700780,"body":"<p>- الخامس‏:‏ عن جابر رضي الله عنه أنه غزا مع النبي صلى الله عليه وسلم قبل نجد، فلما قفل رسول الله صلى الله عليه وسلم قفل معهم، فأدركتهم القائلة في واد كثير العضاه، فنزل رسول الله صلى الله عليه وسلم، وتفرق الناس يستظلون بالشجر، ونزل رسول الله صلى الله عليه وسلم تحت سمرة، فعلق بها سيفه، ونمنا نومة، فإذا رسول الله صلى الله عليه وسلم يدعونا، وإذا عنده أعرابي\t فقال‏:‏ ‏\"‏إن هذا اختراط علي سيفي وأنا نائم، فاسيقظت وهو في يده صلتا، قال‏:‏ من يمنعك منى‏؟‏ قلت‏:‏ الله-ثلاثا‏\"‏ ولم يعاقبه وجلس‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوفي رواية ‏:‏ قال جابر‏:‏ كنا مع رسول الله صلى الله عليه وسلم بذات الرقاع‏:‏ فإذا أتينا على شجرة ظليلة تركناها لرسول الله صلى الله عليه وسلم، فجاء رجل من المشركين، وسيف رسول الله صلى الله عليه وسلم معلق بالشجرة، فاخترطه فقال ‏:‏ تخافني‏؟‏ قال‏:‏ ‏ ‏لا‏ ‏ قال ‏:‏ فمن يمنعك مني ‏؟‏ قال‏:‏ ‏ ‏الله‏ ‏‏.‏\nوفي رواية أبي بكر الإسماعيلى في صحيحه‏:‏ قال‏:‏ من يمنعك مني‏؟‏ قال ‏:‏ ‏ ‏الله‏ ‏ قال‏:‏ فسقط السيف من يده، فأخذ رسول الله صلى الله عليه وسلم السيف فقال‏:‏ ‏ ‏من يمنعك مني‏؟‏‏ ‏ فقال كن خير آخذ، فقال ‏ ‏تشهد أن لا إله إلا الله ، وأني رسول الله‏؟‏ ‏ ‏ قال‏:‏ لا، ولكني أعاهدك أن لا أقاتلك ولا أكون مع قوم يقاتلونك، فخلى سبيله، فأتى أصحابه فقال‏:‏ جئتكم من عند خير الناس‏.‏</p>","grades":[]}]}
