{"collection":"riyadussalihin","bookNumber":"introduction","chapterId":"47.00","hadithNumber":"387","hadith":[{"lang":"en","chapterNumber":"47","chapterTitle":"Signs of Allah's love for His slaves and the efforts for its Achievement","urn":1603830,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"When Allah loves a slave, calls out Jibril and says: 'I love so-and-so; so love him'. Then Jibril loves him. After that he (Jibril) announces to the inhabitants of heavens that Allah loves so- and-so; so love him; and the inhabitants of the heavens (the angels) also love him and then make people on earth love him\".<br/><br/><b>[Al- Bukhari and Muslim]</b>.<br/><br/>Another narration of Muslim is: Messenger of Allah, (ﷺ) said: \"When Allah loves a slave, He calls Jibril (Gabriel) and says: 'I love so-and-so; so love him.' And then Jibril loves him. Then he (Jibril) announces in the heavens saying: Allah loves so-and-so; so love him; then the inhabitants of the heavens (the angels) also love him; and then people on earth love him. And when Allah hates a slave, He calls Jibril and says: 'I hate so- and-so, so hate him.' Then Jibril also hates him. He (Jibril) then announces amongst the inhabitants of heavens: 'Verily, Allah hates so- and-so, so you also hate him.' Thus they also start to hate him. Then he becomes the object of hatred on the earth also\".<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"47","chapterTitle":"- باب علامات حب الله تعالى للعبد والحث على التخلق بها والسعي في تحصيلها‏.‏","urn":1703830,"body":"<p>- وعنه عن النبي، صلى الله عليه وسلم، قال‏:‏ ‏\"‏إذا أحب الله العبد نادى جبريل‏:‏ إن الله تعالى يحب فلانًا، فأحببه، فيحبه جبريل، فينادي في أهل السماء‏:‏ إن الله يحب فلانًا، فأحبوه، فيحبه أهل السماء، ثم يوضع له القبول في الأرض‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوفي رواية لمسلم ‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إن الله تعالى إذا أحب عبدًا دعا جبريل، فقال ‏:‏ إني أحب فلانًا فأحببه، فيحبه جبريل، ثم ينادي في السماء، فيقول‏:‏ إن الله يحب فلانًا، فأحبوه فيحبه أهل السماء، ثم يوضع له القبول في الأرض، وإذا أبغض عبدًا دعا جبريل فيقول‏:‏ إني أبغض فلانًا، فأبغضه، فيبغضه جبريل، ثم ينادي في أهل السماء، إن الله يبغض فلانًا، فأبغضوه، ثم توضع له البغضاء في الأرض‏\"‏‏.‏</p>","grades":[]}]}
