{"collection":"riyadussalihin","bookNumber":"8","chapterId":"191.00","hadithNumber":"1069","hadith":[{"lang":"en","chapterNumber":"191","chapterTitle":"The Excellence of Performing Salat (Prayers) in Congregation","urn":1621120,"body":"<p>Ibn Mas'ud (May Allah be pleased with him) reported: He who likes to meet Allah tomorrow (i.e., on the Day of Requital) as a Muslim, should take care and observe the Salat when the Adhan is announced for them. Allah has expounded to your Prophet (ﷺ) the ways of right guidance, and these (the prayers) are part of the right guidance. If you have to perform Salat in your houses, as this man who stays away (from the mosque) and performs Salat in his house, you will abandon the Sunnah (practice) of your Prophet (ﷺ), and the departure from the Sunnah of your Prophet (ﷺ) will lead you astray. I have seen the time when no one stayed behind except a well-known hypocrite. I also saw that a man was brought swaying (on account of weakness) between two men till he was set up in a row (in the mosque).<br/><br/><b>[Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"191","chapterTitle":"- باب فضل صلاة الجماعة","urn":1710590,"body":"<p>- وعن ابن مسعود رضي الله عنه قال‏:‏ من سره أن يلقى الله تعالى غدًا مسلمًا، فليحافظ على هؤلاء الصلوات، حيث ينادى بهن، فإن الله شرع لنبيكم صلى الله عليه وسلم سنن الهدى، وإنهن من سنن الهدى، ولو أنكم صليتم في بيوتكم كما يصلي هذا المتخلف في بيته لتركتم سنة نبيكم، ولو تركتم سنة نبيكم لضللتم، ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم النفاق، ولقد كان الرجل يؤتى به، يهادى بين الرجلين حتى يقام في الصف‏.‏ ‏(‏‏(‏رواه مسلم وفي رواية له قال‏:‏ إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى، وإن من الهدى الصلاة في المسجد الذي يؤذن فيه‏)‏‏)‏‏.‏</p>","grades":[]}]}
