{"collection":"riyadussalihin","bookNumber":"8","chapterId":"216.00","hadithNumber":"1214","hadith":[{"lang":"en","chapterNumber":"216","chapterTitle":"The Excellence and Obligation of the Payment of Zakat","urn":1622580,"body":"<p>Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Any person who possesses gold or silver and does not pay what is due on it (i.e., the Zakat); on the Day of Resurrection, sheets of silver and gold would be heated for him in the fire of Hell and with them his flank, forehead and back will be branded. When they cool down, they will be heated again and the same process will be repeated during the day the measure whereof will be fifty thousand years. (This would go on) until Judgement is pronounced among (Allah's) slaves, and he will be shown his final abode, either to Jannah or to Hell.\" It was asked, \"How about someone who owns camels and does not pay what is due on him (i.e., their Zakat)?\" He (ﷺ) replied, \"In the same way the owner of camels who does not discharge what is due in respect of them (their due includes their milking on the day when they are taken to water) will be thrown on his face or on his back in a vast desert plain on the Day of Resurrection and they will trample upon him with their hoofs and bite him with their teeth. As often as the first of them passes him, the last of them will be made to return during a day the measure whereof will be fifty thousand years, until Judgement is pronounced among (Allah's) slaves, he will be shown his final abode either to Jannah or to Hell.\" It was (again) asked: \"O Messenger of Allah, what about cows (cattle) and sheep?\" He (ﷺ) said, \"If anyone who possesses cattle and sheep and does not pay what is due on them (i.e., their Zakat); on the Day of Resurrection, he will be thrown on his face in a vast plain desert. He will find none of the animals missing with twisted horns, without horns or with a broken horn, and they will gore him with their horns and trample upon him with their hoofs. As often as the first of them passes him, the last of them will be made to return to him during a day the measure whereof will be fifty thousand years, until Judgement is pronounced among (Allah's) slaves; and he will be shown his final abode either to Jannah or to Hell.\" It was asked: \"O Messenger of Allah, what about the horses?\" Upon this he (ﷺ) said, \"The horses are of three types. One, which is a burden for the owner; another which is a shield, and another one which makes its owner entitled to reward. The one for whom these are a burden is the person who rears them for show or for pride or for causing injury to the sentiments of the Muslims. They will be a cause of torment for their owners. The one for whom these are a shield is the person who rears them for the sake of Allah but does not forget the Right of Allah concerning their backs and their necks (i.e., he lets a needy ride on them), and so they are a shield for him. Those which bring reward to the one who rears them in pastures and gardens are the ones that are used in the Cause of Allah (Jihad) by the Muslims. Whatever they eat from the meadows and the gardens will be recorded on his behalf as good deeds so much so that their droppings and urine will be counted for an equal number of good deeds for him. Even when they break their tying rope and every height from which they climb and every hoofprint which they leave will be counted as a good deed on behalf of the owner. When their owner leads them through a stream from which they drink, though he does not intend to quench their thirst, yet Allah would record for him the quantity (of water) of what they would drink on his behalf as good deeds.\" It was asked: \"O Messenger of Allah, what about the donkeys?\" Upon this he (ﷺ) said, \"Nothing has been revealed to me in regard to the donkeys in particular except this one Verse of a comprehensive nature: \"So whosoever does good equal to the weight of an atom (or a small ant) shall see it. And whosoever does evil equal to the weight of an atom (or a small ant) shall see it.\"' (99: 8,9).<br/><br/><b>[Al- Bukhari and Muslim]</b>.<br/><br/></p>","grades":[]},{"lang":"ar","chapterNumber":"216","chapterTitle":"- باب تاكيد وجوب الزكاة وبيان فضلها وما يتعلق بها‏:‏","urn":1712040,"body":"<p>- وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ما من صاحب ذهب، ولا فضة، لا يؤدي منها حقها إلا إذا كان يوم القيامة صفحت له صفائح من نار، فأحمي عليها في نار جهنم فيكوى بها جنبه، وجبينه، وظهره، كلما بردت أعيدت له في يوم كان مقداره خمسين ألف سنة، حتى يقضى بين العباد فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ قيل‏:‏ يا رسول الله فالإبل‏؟‏ قال‏:‏ ‏\"‏ولا صاحب إبل لا يؤدي منها حقها، ومن حقها حلبها يوم وردها، إلا إذ كان يوم القيامة بطح لها بقاع قرقر أوفر ما كانت، لا يفقد منها فصيلا واحدًا، تطؤه بأخفافها، وتعضه بأفواهها كلما مر عليه أُولاها، رد عليه أُخراها، في يوم كان مقداره خمسين ألف سنة، حتى يقضى بين العباد، فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ قيل‏:‏ يا رسول الله فالبقر والغنم‏؟‏ قال‏:‏ ‏\"‏ولا صاحب بقر ولا غنم لا يؤدي منها حقها إلا إذا كان يوم القيامة، بطح لها بقاع قرقر، لا يفقد منها شيئًا ليس فيها عقصاء، ولا جلحاء، ولا عضباء، تنطحه بقرونها، وتطؤه بأظلافها، كلما مر عليه أُولاها، رد عليه أُخراها، في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد، فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ ‏.‏ قيل‏:‏ يا رسول الله فالخيل‏؟‏ قال‏:‏ ‏\"‏الخيل ثلاثة‏:‏ هي لرجل وزر، وهي لرجل ستر، وهي لرجل أجر، فأما التي هي له وزر فرجل ربطها رياء وفخرًا ونواء على أهل الإسلام، فهي له وزر، وأما التي هي له ستر، فرجل ربطها في سبيل الله، ثم لم ينسَ حق الله في ظهورها، ولا رقابها فهي له ستر، وأما التي هي له أجر، فرجل ربطها في سبيل الله لأهل الإسلام في مرج، أو روضة، فما أكلت من ذلك المرج أو الروضة من شيء إلا كتب له عدد ما أكلت حسنات، وكتب له عدد أرواثها وأبوالها حسنات، ولا تقطع طولها فاستنت شرفًا أو شرفين إلا كتب الله له عدد آثارها، وأرواثها حسنات، ولا مر بها صاحبها على نهر فشربت منه، ولا يريد أن يسقيها إلا كتب الله له عدد ما شربت حسنات‏\"‏ \nوالإيتار قبل النوم إنما يستحب لمن لا يثق باستيقاظ آخر الليل، فإن وثق فآخر الليل أفضل‏.‏</p>","grades":[]}]}
